let factsArr = [
    'PHP — это веб-язык, основанный на сценариях, которые позволяют разработчикам динамически создавать генерируемые веб-страницы.',
    'PHP означает препроцессор гипертекста.',
    'Синтаксис PHP напоминает Perl и C',
    'PEAR означает «Репозиторий расширений и приложений PHP». Он расширяет PHP и обеспечивает более высокий уровень программирования для веб-разработчиков.',
    'imagetypes() дает формат и типы изображений, поддерживаемые текущей версией GD-PHP.',
    'Какие функции следует использовать для получения свойств изображения (размера, ширины и высоты) функции getimagesize() по размеру, imagesx() для ширины и imagesy() для высоты.',
    'Если функция require() не может получить доступ к файлу, то это заканчивается фатальной ошибкой. Однако include() функция выдает предупреждение, и PHP-скрипт продолжает выполняться.',
    'require()качества require_once() выполняет ту же задачу, за исключением того, что вторая функция проверяет, включен ли уже PHP-скрипт, перед его выполнением. (то же самое для include_once() и include())',
    'Функция func_num_args() используется для определения количества параметров, переданных в функцию.',
    'В PHP объекты передаются по значению или по ссылке? В PHP объекты передаются по ссылке.',
    'В чем разница между __sleep и __wakeup? __sleep возвращает массив всех переменных, которые необходимо сохранить, а __wakeup извлекает их.',
    '$_SERVER — это массив, включающий информацию, созданную веб-сервером, такую как пути, заголовки и местоположения сценариев.',
    '$_FILES — это ассоциативный массив, состоящий из элементов, отправленных в текущий скрипт с помощью метода HTTP POST.',
    'В чем разница между $_FILES[userfile][name] и $_FILES[userfile][tmp_name]? $_FILES[userfile][name] представляет исходное имя файла на клиентском компьютере, $_FILES[userfile][tmp_name] представляет временное имя файла, хранящегося на сервере.',
    'Мы можем изменить максимальный размер загружаемых файлов, изменив upload_max_filesize в php.ini.',
    '$_ENV — это ассоциативный массив переменных, отправляемый в текущий PHP-скрипт через метод среды.',
    '$_COOKIE — это ассоциативный массив переменных, отправляемый в текущий сценарий PHP с использованием файлов cookie HTTP.',
    'Логическая функция isset определяет, задана ли переменная и не имеет ли она значение NULL.',
];

export {factsArr}